apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_spiflash.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <string.h>
#include <sys/types.h>
#include <sys/param.h>
#include <inttypes.h>
#include <errno.h>

#include <nuttx/arch.h>
#include <nuttx/init.h>
#include <nuttx/kthread.h>
#include <nuttx/signal.h>
#include <nuttx/kmalloc.h>

#include "sched/sched.h"

#include "xtensa.h"
#include "esp_attr.h"
#include "soc/efuse_reg.h"
#include "hardware/esp32s3_cache_memory.h"
#include "rom/esp32s3_spiflash.h"
#include "esp_irq.h"
#include "esp32s3_spiflash.h"

#include "spi_flash_defs.h"
#include "hal/cache_hal.h"
#include "hal/cache_ll.h"
#include "soc/extmem_reg.h"
#include "soc/spi_mem_reg.h"
#include "rom/opi_flash.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* RO data page in MMU index */

#define DROM0_PAGES_START           (2)
#define DROM0_PAGES_END             (512)

/* MMU base virtual mapped address */

#define VADDR0_START_ADDR           (0x3c020000)

#define VADDR1_START_ADDR           (0x42000000)

/* Flash MMU table for CPU */

#define MMU_TABLE                   ((volatile uint32_t *)DR_REG_MMU_TABLE)

#define MMU_ADDR2PAGE(_addr)        ((_addr) / MMU_PAGE_SIZE)
#define MMU_ADDR2OFF(_addr)         ((_addr) % MMU_PAGE_SIZE)
#define MMU_BYTES2PAGES(_n)         (((_n) + MMU_PAGE_SIZE - 1) / \
                                     MMU_PAGE_SIZE)

#ifdef CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE

#define g_rom_flashchip             (rom_spiflash_legacy_data->chip)

#define MMU_ALIGNUP_SIZE(_s)        (((_s) + MMU_PAGE_SIZE - 1) \
                                     & ~(MMU_PAGE_SIZE - 1))
#define MMU_ALIGNDOWN_SIZE(_s)      ((_s) & ~(MMU_PAGE_SIZE - 1))

/* Flash MMU table for APP CPU */

#define PRO_IRAM0_FIRST_PAGE        (0)
#define IROM0_PAGES_END             (2)

/* SPI port number */

#  define SPI_PORT                  (1)

/* SPI buffer size */

#  define SPI_BUFFER_WORDS          (16)
#  define SPI_BUFFER_BYTES          (SPI_BUFFER_WORDS * 4)

/* SPI flash hardware definition */

#  define FLASH_PAGE_SIZE           (256)
#  define FLASH_SECTOR_SIZE         (4096)

/* SPI flash command */

#  define FLASH_CMD_WRDI            ROM_FLASH_CMD_WRDI
#  define FLASH_CMD_WREN            ROM_FLASH_CMD_WREN
#  define FLASH_CMD_RDSR            ROM_FLASH_CMD_RDSR
#  define FLASH_CMD_SE4B            ROM_FLASH_CMD_SE4B
#  define FLASH_CMD_SE              ROM_FLASH_CMD_ERASE_SEC
#  define FLASH_CMD_PP4B            ROM_FLASH_CMD_PP4B
#  define FLASH_CMD_PP              0x02
#  define FLASH_CMD_FSTRD4B         ROM_FLASH_CMD_FSTRD4B
#  define FLASH_CMD_FSTRD           0x0B

/* SPI flash SR1 bits */

#  define FLASH_SR1_BUSY            ESP_ROM_SPIFLASH_BUSY_FLAG
#  define FLASH_SR1_WREN            ESP_ROM_SPIFLASH_WRENABLE_FLAG

#define SPI_FLASH_DIO_ADDR_BITLEN       24
#define SPI_FLASH_DIO_DUMMY_BITLEN      4
#define SPI_FLASH_QIO_ADDR_BITLEN       24
#define SPI_FLASH_QIO_DUMMY_BITLEN      6
#define SPI_FLASH_QOUT_ADDR_BITLEN      24
#define SPI_FLASH_QOUT_DUMMY_BITLEN     8
#define SPI_FLASH_DOUT_ADDR_BITLEN      24
#define SPI_FLASH_DOUT_DUMMY_BITLEN     8
#define SPI_FLASH_FASTRD_ADDR_BITLEN    24
#define SPI_FLASH_FASTRD_DUMMY_BITLEN   8
#define SPI_FLASH_SLOWRD_ADDR_BITLEN    24
#define SPI_FLASH_SLOWRD_DUMMY_BITLEN   0
#define SPI_FLASH_OPISTR_ADDR_BITLEN    32
#define SPI_FLASH_OPISTR_DUMMY_BITLEN   20
#define SPI_FLASH_OPIDTR_ADDR_BITLEN    32
#define SPI_FLASH_OPIDTR_DUMMY_BITLEN   40
#define SPI_FLASH_QIO_HPM_DUMMY_BITLEN  10
#define SPI_FLASH_DIO_HPM_DUMMY_BITLEN  8

/* SPI flash operation */

#ifndef CONFIG_ESP32S3_FLASH_MODE_OCT
#  define CMD_OPI_FLASH_MXIC(cmd)   (cmd)
#  define CMD_BITLEN(cmd)           (8)
#  ifdef CONFIG_ESP32S3_FLASH_MODE_QIO
#    define READ_DUMMY(addr)        SPI_FLASH_QIO_DUMMY_BITLEN
#    define READ_CMD(addr)          (ADDR_BITS(addr) == 32 ? CMD_FASTRD_QIO_4B : \
                                                             CMD_FASTRD_QIO)
#  elif CONFIG_ESP32S3_FLASH_MODE_QOUT
#    define READ_DUMMY(addr)        SPI_FLASH_QOUT_DUMMY_BITLEN
#    define READ_CMD(addr)          (ADDR_BITS(addr) == 32 ? CMD_FASTRD_QUAD_4B : \
                                                             CMD_FASTRD_QUAD)
#  elif CONFIG_ESP32S3_FLASH_MODE_DIO
#    define READ_DUMMY(addr)        SPI_FLASH_DIO_DUMMY_BITLEN
#    define READ_CMD(addr)          (ADDR_BITS(addr) == 32 ? CMD_FASTRD_DIO_4B : \
                                                             CMD_FASTRD_DIO)
#  elif CONFIG_ESP32S3_FLASH_MODE_DOUT
#    define READ_DUMMY(addr)        SPI_FLASH_DOUT_DUMMY_BITLEN
#    define READ_CMD(addr)          (ADDR_BITS(addr) == 32 ? CMD_FASTRD_DUAL_4B : \
                                                             CMD_FASTRD_DUAL)
#  else /* SPI_FLASH_FASTRD */
#    define READ_DUMMY(addr)        SPI_FLASH_FASTRD_DUMMY_BITLEN
#    define READ_CMD(addr)          (ADDR_BITS(addr) == 32 ? FLASH_CMD_FSTRD4B : \
                                                             FLASH_CMD_FSTRD)
#  endif
#  ifdef CONFIG_ESP32S3_SPI_FLASH_USE_32BIT_ADDRESS
#    define ADDR_BITS(addr)         (((addr) & 0xff000000) ? 32 : 24)
#    define WRITE_CMD(addr)         (ADDR_BITS(addr) == 32 ? FLASH_CMD_PP4B : \
                                                             FLASH_CMD_PP)
#    define ERASE_CMD(addr)         (ADDR_BITS(addr) == 32 ? FLASH_CMD_SE4B : \
                                                             FLASH_CMD_SE)
#  else
#    define ADDR_BITS(addr)         24
#    define WRITE_CMD(addr)         FLASH_CMD_PP
#    define ERASE_CMD(addr)         FLASH_CMD_SE
#  endif
#  define READ_REG_DUMMY(addr)      (0)
#else /* CONFIG_ESP32S3_FLASH_MODE_OCT */
#    define CMD_OPI_FLASH_MXIC(cmd) ((((~(cmd) & 0xff) << 8)) | ((cmd) & 0xff))
#    define CMD_OPI_FLASH_MXIC_CHIP_ERASE        0x9F60
#    define CMD_OPI_FLASH_MXIC_READ_STR          0x13EC
#    define CMD_OPI_FLASH_MXIC_READ_DTR          0x11EE
#    define CMD_OPI_FLASH_MXIC_RDCR2             0x8E71
#    define CMD_OPI_FLASH_MXIC_WRCR2             0x8D72
#    define CMD_BITLEN(cmd)         (cmd >= 0x100 ? 16 : 8)
#    define ADDR_BITS(addr)         (32)
#    ifdef CONFIG_ESP32S3_FLASH_SAMPLE_MODE_STR
#      define READ_CMD(addr)          CMD_OPI_FLASH_MXIC_READ_STR
#    else
#      define READ_CMD(addr)          CMD_OPI_FLASH_MXIC_READ_DTR
#    endif
#    define WRITE_CMD(addr)         CMD_OPI_FLASH_MXIC(FLASH_CMD_PP4B)
#    define ERASE_CMD(addr)         CMD_OPI_FLASH_MXIC(FLASH_CMD_SE4B)
#    ifdef CONFIG_ESP32S3_FLASH_SAMPLE_MODE_STR
#      define READ_DUMMY(addr)          SPI_FLASH_OPISTR_DUMMY_BITLEN
#      define READ_REG_DUMMY(addr)      4
#    else /* CONFIG_ESP32S3_FLASH_SAMPLE_MODE_DTR */
#      define READ_DUMMY(addr)          CMD_OPI_FLASH_MXIC_READ_DTR
#      define READ_REG_DUMMY(addr)      8
#    endif
#endif /* !CONFIG_ESP32S3_FLASH_MODE_OCT*/

#  define SEND_CMD8_TO_FLASH(cmd)                           \
    esp32s3_spi_trans((cmd), CMD_BITLEN(cmd),               \
                      0, 0,                                 \
                      NULL, 0,                              \
                      NULL, 0,                              \
                      0,                                    \
                      false)

#  define READ_SR1_FROM_FLASH(cmd, status)                  \
    esp32s3_spi_trans((cmd), CMD_BITLEN(cmd),               \
                      0, ADDR_BITS(0),                      \
                      NULL, 0,                              \
                      (status), 1,                          \
                      READ_REG_DUMMY(0),                    \
                      false)

