apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash.c
#  define ERASE_FLASH_SECTOR(addr)                          \
    esp32s3_spi_trans(ERASE_CMD(addr),                      \
                      CMD_BITLEN(ERASE_CMD(addr)),          \
                      (addr), ADDR_BITS(addr),              \
                      NULL, 0,                              \
                      NULL, 0,                              \
                      0,                                    \
                      true)

#  define WRITE_DATA_TO_FLASH(addr, buffer, size)           \
    esp32s3_spi_trans(WRITE_CMD(addr),                      \
                      CMD_BITLEN(WRITE_CMD(addr)),          \
                      (addr), ADDR_BITS(addr),              \
                      buffer, size,                         \
                      NULL, 0,                              \
                      0,                                    \
                      true)

#  define READ_DATA_FROM_FLASH(addr, buffer, size)          \
    esp32s3_spi_trans(READ_CMD(addr),                       \
                      CMD_BITLEN(READ_CMD(addr)),           \
                      (addr), ADDR_BITS(addr),              \
                      NULL, 0,                              \
                      buffer, size,                         \
                      READ_DUMMY(addr),                     \
                      false)

#endif /* CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE */

/****************************************************************************
 * Private Functions Declaration
 ****************************************************************************/

void spiflash_start(void);
void spiflash_end(void);
static void spi_flash_disable_cache(void);
static void spi_flash_restore_cache(void);
#ifdef CONFIG_SMP
static int spi_flash_op_block_task(int argc, char *argv[]);
static int spiflash_init_spi_flash_op_block_task(int cpu);
#endif

/****************************************************************************
 * Public Functions Declaration
 ****************************************************************************/

extern uint32_t cache_suspend_icache(void);
extern uint32_t cache_suspend_dcache(void);
extern void cache_resume_icache(uint32_t val);
extern void cache_resume_dcache(uint32_t val);
extern int cache_invalidate_addr(uint32_t addr, uint32_t size);
extern void cache_invalidate_icache_all(void);

#ifndef CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE
extern void spi_flash_mmap_os_func_set(void *(*func1)(size_t size),
                                       void (*func2)(void *p));
extern esp_err_t spi_flash_mmap_page_num_init(uint32_t page_num);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static spi_flash_guard_funcs_t g_spi_flash_guard_funcs =
{
  .start           = spiflash_start,
  .end             = spiflash_end,
};

static uint32_t s_flash_op_cache_state[CONFIG_SMP_NCPUS];

static rmutex_t g_flash_op_mutex;
static volatile bool g_flash_op_can_start = false;
static volatile bool g_flash_op_complete = false;
static volatile bool g_spi_flash_cache_suspended = false;
static volatile bool g_sched_suspended[CONFIG_SMP_NCPUS];
static volatile bool g_flash_chip_busy = false;
#ifdef CONFIG_SMP
static sem_t g_disable_non_iram_isr_on_core[CONFIG_SMP_NCPUS];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: spiflash_suspend_cache
 *
 * Description:
 *   Suspend CPU cache.
 *
 ****************************************************************************/

static void spiflash_suspend_cache(void)
{
  int cpu = this_cpu();
#ifdef CONFIG_SMP
  int other_cpu = cpu ? 0 : 1;
#endif

  spi_flash_disable_cache();

  g_spi_flash_cache_suspended = true;
}

/****************************************************************************
 * Name: spiflash_start
 *
 * Description:
 *   Prepare for an SPI flash operation.
 *
 ****************************************************************************/

void spiflash_start(void)
{
  struct tcb_s *tcb = this_task();
  int saved_priority = tcb->sched_priority;
  int cpu;
#ifdef CONFIG_SMP
  int other_cpu;
#endif

  nxrmutex_lock(&g_flash_op_mutex);

  /* Temporary raise schedule priority */

  nxsched_set_priority(tcb, SCHED_PRIORITY_MAX);

  cpu = this_cpu();
#ifdef CONFIG_SMP
  other_cpu = cpu == 1 ? 0 : 1;
#endif

  DEBUGASSERT(cpu == 0 || cpu == 1);

#ifdef CONFIG_SMP
  DEBUGASSERT(other_cpu == 0 || other_cpu == 1);
  DEBUGASSERT(other_cpu != cpu);
  if (OSINIT_OS_READY())
    {
      g_flash_op_can_start = false;

      cpu = this_cpu();
      other_cpu = cpu ? 0 : 1;

      nxsem_post(&g_disable_non_iram_isr_on_core[other_cpu]);

      while (!g_flash_op_can_start)
        {
          /* Busy loop and wait for spi_flash_op_block_task to disable cache
           * on the other CPU
           */
        }
    }
#endif

  g_sched_suspended[cpu] = true;

  sched_lock();

  nxsched_set_priority(tcb, saved_priority);

  esp_intr_noniram_disable();

  spiflash_suspend_cache();
}

/****************************************************************************
 * Name: spiflash_end
 *
 * Description:
 *   Undo all the steps of spiflash_start.
 *
 ****************************************************************************/

void spiflash_end(void)
{
  const int cpu = this_cpu();
#ifdef CONFIG_SMP
  const int other_cpu = cpu ? 0 : 1;
#endif

  DEBUGASSERT(cpu == 0 || cpu == 1);

#ifdef CONFIG_SMP
  DEBUGASSERT(other_cpu == 0 || other_cpu == 1);
  DEBUGASSERT(other_cpu != cpu);
#endif

  cache_invalidate_icache_all();
  spiflash_resume_cache();

  /* Signal to spi_flash_op_block_task that flash operation is complete */

  g_flash_op_complete = true;

  esp_intr_noniram_enable();

  sched_unlock();

