apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash.c
  g_sched_suspended[cpu] = false;

#ifdef CONFIG_SMP
  while (g_sched_suspended[other_cpu])
    {
      /* Busy loop and wait for spi_flash_op_block_task to properly finish
       * and resume scheduler
       */
    }
#endif

  nxrmutex_unlock(&g_flash_op_mutex);
}

/****************************************************************************
 * Name: esp32s3_spi_trans
 *
 * Description:
 *   Transmit given command, address and data.
 *
 * Input Parameters:
 *   command      - command value
 *   command_bits - command bits
 *   address      - address value
 *   address_bits - address bits
 *   tx_buffer    - write buffer
 *   tx_bytes     - write buffer size
 *   rx_buffer    - read buffer
 *   rx_bytes     - read buffer size
 *   dummy_bits   - dummy bits
 *   is_program   - true if operation is program or erase
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE
static void esp32s3_spi_trans(uint32_t command,
                              uint32_t command_bits,
                              uint32_t address,
                              uint32_t address_bits,
                              uint32_t *tx_buffer,
                              uint32_t tx_bytes,
                              uint32_t *rx_buffer,
                              uint32_t rx_bytes,
                              uint32_t dummy_bits,
                              bool is_program)
{
  uint32_t regval;
  uint32_t cmd_reg;
  uint32_t user1_reg = getreg32(SPI_MEM_USER1_REG(SPI_PORT));
  uint32_t user_reg = getreg32(SPI_MEM_USER_REG(SPI_PORT));

  /* Initialize SPI user register */

  user_reg &= ~(SPI_MEM_USR_DUMMY_M | SPI_MEM_USR_MOSI_M |
                SPI_MEM_USR_MISO_M | SPI_MEM_USR_ADDR_M);
  user_reg |= SPI_MEM_USR_COMMAND_M;

  /* Wait until SPI is idle */

  do
    {
      cmd_reg = getreg32(SPI_MEM_CMD_REG(SPI_PORT));
    }
  while ((cmd_reg & SPI_MEM_USR_M) != 0);

  /* Set command bits and value, and command is always needed */

  regval  = getreg32(SPI_MEM_USER2_REG(SPI_PORT));
  regval &= ~(SPI_MEM_USR_COMMAND_BITLEN_M | SPI_MEM_USR_COMMAND_VALUE_M);
  regval |= ((command_bits - 1) << SPI_MEM_USR_COMMAND_BITLEN_S) |
            (command << SPI_MEM_USR_COMMAND_VALUE_S);
  putreg32(regval, SPI_MEM_USER2_REG(SPI_PORT));

  /* Set address bits and value */

  user1_reg &= ~SPI_MEM_USR_ADDR_BITLEN_M;
  user1_reg |= (address_bits - 1) << SPI_MEM_USR_ADDR_BITLEN_S;

  putreg32(address, SPI_MEM_ADDR_REG(SPI_PORT));

  regval  = getreg32(SPI_MEM_CACHE_FCTRL_REG(SPI_PORT));
  if (address_bits > 24)
    {
      regval |= SPI_MEM_CACHE_USR_CMD_4BYTE_M;
    }
  else
    {
      regval &= ~SPI_MEM_CACHE_USR_CMD_4BYTE_M;
    }

  if (address_bits)
    {
      user_reg |= SPI_MEM_USR_ADDR_M;
    }

  putreg32(regval, SPI_MEM_CACHE_FCTRL_REG(SPI_PORT));

  /* Set dummy */

  user1_reg &= ~SPI_MEM_USR_DUMMY_CYCLELEN_M;

  if (dummy_bits)
    {
      user_reg |= SPI_MEM_USR_DUMMY_M;
      user1_reg |= (dummy_bits - 1) << SPI_MEM_USR_DUMMY_CYCLELEN_S;
    }
  else
    {
      user1_reg |= SPI_MEM_USR_DUMMY_CYCLELEN_M;
    }

  /* Set TX data */

  if (tx_bytes)
    {
      putreg32(tx_bytes * 8 - 1, SPI_MEM_MOSI_DLEN_REG(SPI_PORT));
      for (uint32_t i = 0; i < tx_bytes; i += 4)
        {
          putreg32(tx_buffer[i / 4], SPI_MEM_W0_REG(SPI_PORT) + i);
        }

      user_reg |= SPI_MEM_USR_MOSI_M;
    }

  /* Set RX data */

  if (rx_bytes)
    {
      putreg32(rx_bytes * 8 - 1, SPI_MEM_MISO_DLEN_REG(SPI_PORT));
      user_reg |= SPI_MEM_USR_MISO_M;
    }
  else
    {
      putreg32(0, SPI_MEM_MISO_DLEN_REG(SPI_PORT));
    }

  putreg32(user_reg,  SPI_MEM_USER_REG(SPI_PORT));
  putreg32(user1_reg, SPI_MEM_USER1_REG(SPI_PORT));

  /* Set I/O mode */

  regval = getreg32(SPI_MEM_CTRL_REG(SPI_PORT));
  regval &= ~(SPI_MEM_FREAD_QIO_M | SPI_MEM_FREAD_DIO_M |
              SPI_MEM_FREAD_QUAD_M | SPI_MEM_FREAD_DUAL_M |
              SPI_MEM_FCMD_OCT_M | SPI_MEM_FCMD_QUAD_M |
              SPI_MEM_FCMD_DUAL_M | SPI_MEM_FADDR_OCT_M |
              SPI_MEM_FDIN_OCT_M | SPI_MEM_FDOUT_OCT_M |
              SPI_MEM_FDUMMY_OUT_M | SPI_MEM_RESANDRES_M |
              SPI_MEM_WP_REG_M | SPI_MEM_WRSR_2B_M |
              SPI_MEM_FASTRD_MODE_M);
  regval |= (SPI_MEM_Q_POL_M | SPI_MEM_D_POL_M);
#ifdef CONFIG_ESP32S3_FLASH_MODE_QIO
  if (command == READ_CMD(address))
    {
      regval |= SPI_MEM_FREAD_QIO_M;
      regval |= SPI_MEM_FASTRD_MODE_M;
      regval |= SPI_MEM_FDUMMY_OUT_M;
    }
#elif CONFIG_ESP32S3_FLASH_MODE_QOUT
  if (command == READ_CMD(address))
    {
      regval |= SPI_MEM_FREAD_QUAD_M;
      regval |= SPI_MEM_FASTRD_MODE_M;
    }
#elif CONFIG_ESP32S3_FLASH_MODE_DIO
  if (command == READ_CMD(address))
    {
      regval |= SPI_MEM_FREAD_DIO_M;
      regval |= SPI_MEM_FASTRD_MODE_M;
      regval |= SPI_MEM_FDUMMY_OUT_M;
    }
#elif CONFIG_ESP32S3_FLASH_MODE_DOUT
  if (command == READ_CMD(address))
    {
      regval |= SPI_MEM_FREAD_DUAL_M;
      regval |= SPI_MEM_FASTRD_MODE_M;
    }
#elif CONFIG_ESP32S3_FLASH_MODE_OCT
  regval |= SPI_MEM_FASTRD_MODE_M;
#  ifdef CONFIG_ESP32S3_FLASH_SAMPLE_MODE_STR
  regval |= (SPI_MEM_FADDR_OCT_M | SPI_MEM_FCMD_OCT_M |
             SPI_MEM_FDIN_OCT_M | SPI_MEM_FDOUT_OCT_M);
#  elif CONFIG_ESP32S3_FLASH_SAMPLE_MODE_DTR
#    error "Not yet implemented"
#  endif
#else /* SPI_FLASH_FASTRD */
  if (command == READ_CMD(address))
    {
      regval |= SPI_MEM_FASTRD_MODE_M;
    }
#endif

  putreg32(regval, SPI_MEM_CTRL_REG(SPI_PORT));

  /* Set clock and delay */

  putreg32(0, SPI_MEM_CLOCK_GATE_REG(SPI_PORT));

  /* Set if this is program or erase operation */

  if (is_program)
    {
      cmd_reg |= SPI_MEM_FLASH_PE_M;
    }

  /* Start transmission */

  cmd_reg |= SPI_MEM_USR_M;
  putreg32(cmd_reg, SPI_MEM_CMD_REG(SPI_PORT));

  /* Wait until transmission is done */

  while ((getreg32(SPI_MEM_CMD_REG(SPI_PORT)) & SPI_MEM_USR_M) != 0)
    {
      ;
    }

