apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash.c
  /* Get read data */

  if (rx_bytes)
    {
      for (uint32_t i = 0; i < rx_bytes; i += 4)
        {
          rx_buffer[i / 4] = getreg32(SPI_MEM_W0_REG(SPI_PORT) + i);
        }
    }
}

/****************************************************************************
 * Name: wait_flash_idle
 *
 * Description:
 *   Wait until flash enters idle state
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void wait_flash_idle(void)
{
  uint32_t status;

  do
    {
      READ_SR1_FROM_FLASH(CMD_OPI_FLASH_MXIC(FLASH_CMD_RDSR), &status);
      if ((status & FLASH_SR1_BUSY) == 0)
        {
          if (g_flash_chip_busy == true)
            {
              g_flash_chip_busy = 0;
              if ((status & FLASH_SR1_WREN) != 0)
                {
                  /* The previous command is not accepted, leaving the WEL
                   * bit still set.
                   */

                  return;
                }
            }
          break;
        }
    }
  while (1);
}

/****************************************************************************
 * Name: enable_flash_write
 *
 * Description:
 *   Enable Flash write mode
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void enable_flash_write(void)
{
  uint32_t status;

  do
    {
      SEND_CMD8_TO_FLASH(CMD_OPI_FLASH_MXIC(FLASH_CMD_WREN));
      READ_SR1_FROM_FLASH(CMD_OPI_FLASH_MXIC(FLASH_CMD_RDSR), &status);
      if ((status & FLASH_SR1_WREN) != 0)
        {
          break;
        }
    }
  while (1);
}

/****************************************************************************
 * Name: disable_flash_write
 *
 * Description:
 *   Disable Flash write mode
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void disable_flash_write(void)
{
  uint32_t status;

  do
    {
      SEND_CMD8_TO_FLASH(CMD_OPI_FLASH_MXIC(FLASH_CMD_WRDI));
      READ_SR1_FROM_FLASH(CMD_OPI_FLASH_MXIC(FLASH_CMD_RDSR), &status);
      if ((status & FLASH_SR1_WREN) == 0)
        {
          break;
        }
    }
  while (1);
}

/****************************************************************************
 * Name: spiflash_pagecached
 *
 * Description:
 *   Check if the given page is cached.
 *
 * Input Parameters:
 *   phypage - physical address page.
 *   ptr     - Pointer to the virtual address.
 *
 * Returned Value:
 *   True if flash address has corresponding cache mapping, false otherwise.
 *
 ****************************************************************************/

static bool IRAM_ATTR spiflash_pagecached(uint32_t phypage, uint32_t *ptr)
{
  int start[2];
  int end[2];
  int i;
  int j;

  /* Data ROM start and end pages */

  start[0] = DROM0_PAGES_START;
  end[0]   = DROM0_PAGES_END;

  /* Instruction RAM start and end pages */

  start[1] = PRO_IRAM0_FIRST_PAGE;
  end[1]   = IROM0_PAGES_END;

  for (i = 0; i < 2; i++)
    {
      for (j = start[i]; j < end[i]; j++)
        {
          if (MMU_TABLE[j] == phypage)
            {
              if (i == 0)
                {
                  /* SPI_FLASH_MMAP_DATA */

                  *ptr = (VADDR0_START_ADDR +
                          MMU_PAGE_SIZE * (j - start[0]));
                }
              else
                {
                  /* SPI_FLASH_MMAP_INST */

                  *ptr = (VADDR1_START_ADDR +
                          MMU_PAGE_SIZE * (j - start[1]));
                }

              return true;
            }
        }
    }

  return false;
}

/****************************************************************************
 * Name: spiflash_flushmapped
 *
 * Description:
 *   Writeback PSRAM data and invalidate the cache if the address is mapped.
 *
 * Input Parameters:
 *   start - SPI Flash address.
 *   size  - SPI Flash size.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void IRAM_ATTR spiflash_flushmapped(size_t start, size_t size)
{
  uint32_t page_start;
  uint32_t addr;
  uint32_t page;
  uint32_t vaddr;

  page_start = MMU_ALIGNDOWN_SIZE(start);
  size += (start - page_start);
  size = MMU_ALIGNUP_SIZE(size);

  for (addr = page_start; addr < page_start + size;
       addr += MMU_PAGE_SIZE)
    {
      page = addr / MMU_PAGE_SIZE;
      if (addr >= g_rom_flashchip.chip_size)
        {
          return;
        }

      if (spiflash_pagecached(page, &vaddr))
        {
          cache_invalidate_addr(vaddr, MMU_PAGE_SIZE);
        }
    }
}

/****************************************************************************
 * Name: spiflash_os_yield
 *
 * Description:
 *   Yield to other tasks, called during erase operations.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void IRAM_ATTR spiflash_os_yield(void)
{
  /* Delay 1 tick */

  useconds_t us = TICK2USEC(1);
  nxsched_usleep(us);
}
#endif /* CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE */

/****************************************************************************
 * Name: spi_flash_disable_cache
 *
 * Description:
 *   Disable the I/D cache of a CPU core and save its status value on
 *   s_flash_op_cache_state.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spi_flash_disable_cache(void)
{
  cache_hal_suspend(CACHE_LL_LEVEL_EXT_MEM, CACHE_TYPE_ALL);
}

/****************************************************************************
 * Name: spi_flash_restore_cache
 *
 * Description:
 *   Restore the I/D cache of a CPU core using the saved status value on
 *   s_flash_op_cache_state.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spi_flash_restore_cache(void)
{
  cache_hal_resume(CACHE_LL_LEVEL_EXT_MEM, CACHE_TYPE_ALL);
}

#ifdef CONFIG_SMP

/****************************************************************************
 * Name: spi_flash_op_block_task
 *
 * Description:
 *   Disable the non-IRAM interrupts on the other core (the one that isn't
 *   handling the SPI flash operation) and notify that the SPI flash
 *   operation can start. Wait on a busy loop until it's finished and then
 *   re-enable the non-IRAM interrupts.
 *
 * Input Parameters:
 *   argc          - Not used.
 *   argv          - Not used.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned to
 *   indicate the nature of any failure.
 *
 ****************************************************************************/

static int spi_flash_op_block_task(int argc, char *argv[])
{
  struct tcb_s *tcb = this_task();
  int cpu = this_cpu();

