apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spiflash.c
  ret = esp32s3_mmap(&req);
  if (ret < 0)
    {
      return ret;
    }

  memcpy(buffer, req.ptr, size);

  esp32s3_ummap(&req);

  return OK;
}

/****************************************************************************
 * Name: spi_flash_erase_sector
 *
 * Description:
 *   Erase the Flash sector.
 *
 * Parameters:
 *   sector - Sector number, the count starts at sector 0, 4KB per sector.
 *
 * Returned Values: esp_err_t
 *   Zero (OK) is returned or a negative error.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE
int spi_flash_erase_sector(uint32_t sector)
{
  int ret = OK;
  uint32_t addr = sector * FLASH_SECTOR_SIZE;

  spiflash_start();

  wait_flash_idle();
  enable_flash_write();

  ERASE_FLASH_SECTOR(addr);
  g_flash_chip_busy = true;

  wait_flash_idle();
  disable_flash_write();
  spiflash_flushmapped(addr, FLASH_SECTOR_SIZE);
  spiflash_end();

  return ret;
}

/****************************************************************************
 * Name: spi_flash_erase_range
 *
 * Description:
 *   Erase a range of flash sectors
 *
 * Parameters:
 *   start_address - Address where erase operation has to start.
 *                   Must be 4kB-aligned
 *   size          - Size of erased range, in bytes. Must be divisible by
 *                   4kB.
 *
 * Returned Values:
 *   Zero (OK) is returned or a negative error.
 *
 ****************************************************************************/

int spi_flash_erase_range(uint32_t start_address, uint32_t size)
{
  int ret = OK;
  uint32_t addr = start_address;

  for (uint32_t i = 0; i < size; i += FLASH_SECTOR_SIZE)
    {
      if (i > 0)
        {
          spiflash_os_yield();
        }

      spiflash_start();
      wait_flash_idle();
      enable_flash_write();
      wait_flash_idle();

      ERASE_FLASH_SECTOR(addr);
      g_flash_chip_busy = true;
      addr += FLASH_SECTOR_SIZE;
      wait_flash_idle();
      disable_flash_write();
      spiflash_end();
    }

  spiflash_start();
  spiflash_flushmapped(start_address, FLASH_SECTOR_SIZE * size);
  spiflash_end();

  return ret;
}

/****************************************************************************
 * Name: spi_flash_write
 *
 * Description:
 *   Write data to Flash.
 *
 * Parameters:
 *   dest_addr - Destination address in Flash.
 *   src       - Pointer to the source buffer.
 *   size      - Length of data, in bytes.
 *
 * Returned Values:
 *   Zero (OK) is returned or a negative error.
 *
 ****************************************************************************/

int spi_flash_write(uint32_t dest_addr, const void *buffer, uint32_t size)
{
  int ret = OK;
  const uint8_t *tx_buf = (const uint8_t *)buffer;
  uint32_t tx_bytes = size;
  uint32_t tx_addr = dest_addr;
#ifdef CONFIG_ESP32S3_SPIRAM
  bool buffer_in_psram = esp32s3_ptr_extram(buffer);
#endif

  spiflash_start();

  while (tx_bytes)
    {
      uint32_t spi_buffer[SPI_BUFFER_WORDS];
      uint32_t n = FLASH_PAGE_SIZE - tx_addr % FLASH_PAGE_SIZE;
      n = MIN(n, MIN(tx_bytes, SPI_BUFFER_BYTES));

#ifdef CONFIG_ESP32S3_SPIRAM

      /* Re-enable cache, and then copy data from PSRAM to SRAM */

      if (buffer_in_psram)
        {
          spiflash_resume_cache();
        }
#endif

      memcpy(spi_buffer, tx_buf, n);

#ifdef CONFIG_ESP32S3_SPIRAM

      /* Disable cache, and then write data from SRAM to flash */

      if (buffer_in_psram)
        {
          spiflash_suspend_cache();
        }
#endif

      wait_flash_idle();
      enable_flash_write();

      WRITE_DATA_TO_FLASH(tx_addr, spi_buffer, n);
      g_flash_chip_busy = true;

      tx_bytes -= n;
      tx_buf += n;
      tx_addr += n;
    }

  wait_flash_idle();
  disable_flash_write();
  spiflash_flushmapped(dest_addr, size);
  spiflash_end();

  return ret;
}

/****************************************************************************
 * Name: spi_flash_read
 *
 * Description:
 *   Read data from Flash.
 *
 * Parameters:
 *   src_addr - source address of the data in Flash.
 *   dest     - pointer to the destination buffer
 *   size     - length of data
 *
 * Returned Values:
 *   Zero (OK) is returned or a negative error.
 *
 ****************************************************************************/

int spi_flash_read(uint32_t src_addr, void *dest, uint32_t size)
{
  int ret = OK;
  uint8_t *rx_buf = (uint8_t *)dest;
  uint32_t rx_bytes = size;
  uint32_t rx_addr = src_addr;
#ifdef CONFIG_ESP32S3_SPIRAM
  bool buffer_in_psram = esp32s3_ptr_extram(dest);
#endif

  spiflash_start();

  for (uint32_t i = 0; i < size; i += SPI_BUFFER_BYTES)
    {
      uint32_t spi_buffer[SPI_BUFFER_WORDS];
      uint32_t n = MIN(rx_bytes, SPI_BUFFER_BYTES);

      READ_DATA_FROM_FLASH(rx_addr, spi_buffer, n);

#ifdef CONFIG_ESP32S3_SPIRAM

      /* Re-enable cache, and then copy data from SRAM to PSRAM */

      if (buffer_in_psram)
        {
          spiflash_resume_cache();
        }
#endif

      memcpy(rx_buf, spi_buffer, n);
      rx_bytes -= n;
      rx_buf += n;
      rx_addr += n;

#ifdef CONFIG_ESP32S3_SPIRAM

      /* Disable cache, and then read data from flash to SRAM */

      if (buffer_in_psram)
        {
          spiflash_suspend_cache();
        }
#endif
    }

  spiflash_end();

  return ret;
}
#endif /* CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE */

/****************************************************************************
 * Name: esp32s3_spiflash_init
 *
 * Description:
 *   Initialize ESP32-S3 SPI flash driver.
 *
 * Returned Value:
 *   OK if success or a negative value if fail.
 *
 ****************************************************************************/

int esp32s3_spiflash_init(void)
{
  int cpu;
  int ret = OK;

  /* Initializes SPI flash operation lock */

  nxrmutex_init(&g_flash_op_mutex);

#ifdef CONFIG_SMP
  sched_lock();

  for (cpu = 0; cpu < CONFIG_SMP_NCPUS; cpu++)
    {
      nxsem_init(&g_disable_non_iram_isr_on_core[cpu], 0, 0);

      ret = spiflash_init_spi_flash_op_block_task(cpu);
      if (ret != OK)
        {
          return ret;
        }
    }

  sched_unlock();
#else
  UNUSED(cpu);
#endif

  spi_flash_guard_set(&g_spi_flash_guard_funcs);

#ifndef CONFIG_ESP32S3_SPI_FLASH_DONT_USE_ROM_CODE

  /* These two functions are in ROM only */

  spi_flash_mmap_os_func_set(malloc, free);
  spi_flash_mmap_page_num_init(128);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp32s3_flash_encryption_enabled
 *
 * Description:
 *   Check if ESP32-S3 enables SPI Flash encryption.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   True: SPI Flash encryption is enable, False if not.
 *
 ****************************************************************************/

bool esp32s3_flash_encryption_enabled(void)
{
  bool enabled = false;
  uint32_t regval;
  uint32_t flash_crypt_cnt;

  regval = getreg32(EFUSE_RD_REPEAT_DATA1_REG);
  flash_crypt_cnt = (regval >> EFUSE_SPI_BOOT_CRYPT_CNT_S) &
                    EFUSE_SPI_BOOT_CRYPT_CNT_V;

  while (flash_crypt_cnt)
    {
      if (flash_crypt_cnt & 1)
        {
          enabled = !enabled;
        }

      flash_crypt_cnt >>= 1;
    }

  return enabled;
}

/****************************************************************************
 * Name: esp32s3_get_flash_address_mapped_as_text
 *
 * Description:
 *   Get flash address which is currently mapped as text
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   flash address which is currently mapped as text
 *
 ****************************************************************************/

uint32_t esp32s3_get_flash_address_mapped_as_text(void)
{
  uint32_t i = MMU_ADDR2PAGE((uint32_t)_stext) -
               MMU_ADDR2PAGE(SOC_MMU_IBUS_VADDR_BASE);
  return (FLASH_MMU_TABLE[i] & MMU_ADDRESS_MASK) * MMU_PAGE_SIZE;
}
